In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("N:\\bandera\GIS\split_combine.csv")

In [3]:
df

   id  key   x   y
0   1    1  33  70
1   2    1  32  71
2   3    2  34  74
3   4    2  35  75

In [4]:
df_pivot = df.pivot(index='id', columns='key', values='x')

In [5]:
df_pivot

key     1     2
id
1    33.0   NaN
2    32.0   NaN
3     NaN  34.0
4     NaN  35.0

In [6]:
df

   id  key   x   y
0   1    1  33  70
1   2    1  32  71
2   3    2  34  74
3   4    2  35  75

In [7]:
df1 = df[df['key'] == 1]

In [8]:
df1

   id  key   x   y
0   1    1  33  70
1   2    1  32  71

In [9]:
df

   id  key   x   y
0   1    1  33  70
1   2    1  32  71
2   3    2  34  74
3   4    2  35  75

In [10]:
dfmerge = pd.merge(df, df, left_on=['key'], right_on=['key'],suffixes=('_s','_e'))

In [11]:
dfmerge

   id_s  key  x_s  y_s  id_e  x_e  y_e
0     1    1   33   70     1   33   70
1     1    1   33   70     2   32   71
2     2    1   32   71     1   33   70
3     2    1   32   71     2   32   71
4     3    2   34   74     3   34   74
5     3    2   34   74     4   35   75
6     4    2   35   75     3   34   74
7     4    2   35   75     4   35   75

In [12]:
df

   id  key   x   y
0   1    1  33  70
1   2    1  32  71
2   3    2  34  74
3   4    2  35  75

In [13]:
dfmerge = pd.merge(df, df, on=['key'], indicator=True)

In [14]:
dfmerge

   id_x  key  x_x  y_x  id_y  x_y  y_y _merge
0     1    1   33   70     1   33   70   both
1     1    1   33   70     2   32   71   both
2     2    1   32   71     1   33   70   both
3     2    1   32   71     2   32   71   both
4     3    2   34   74     3   34   74   both
5     3    2   34   74     4   35   75   both
6     4    2   35   75     3   34   74   both
7     4    2   35   75     4   35   75   both

In [15]:
df

   id  key   x   y
0   1    1  33  70
1   2    1  32  71
2   3    2  34  74
3   4    2  35  75

In [17]:
df1 = pd.read_csv("N:\\bandera\GIS\split_combine.csv")

In [18]:
df

   id  key   x   y
0   1    1  33  70
1   2    1  32  71
2   3    2  34  74
3   4    2  35  75

In [19]:
df1

   id  key   x   y
0   1    1  33  70
1   2    1  32  71
2   3    2  34  74
3   4    2  35  75

In [21]:
df.drop('id', axis=1)

   key   x   y
0    1  33  70
1    1  32  71
2    2  34  74
3    2  35  75

In [37]:
df.as_matrix

<bound method DataFrame.as_matrix of    id  key   x   y
0   1    1  33  70
1   2    1  32  71
2   3    2  34  74
3   4    2  35  75>

In [38]:
df

   id  key   x   y
0   1    1  33  70
1   2    1  32  71
2   3    2  34  74
3   4    2  35  75

In [28]:
import numpy as np

In [29]:
rng = pd.date_range('2000-01-01', periods=6)

In [30]:
rng

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06'],
              dtype='datetime64[ns]', freq='D')

In [31]:
df1 = pd.DataFrame(np.random.randn(6, 3), index=rng, columns=['A', 'B', 'C'])

In [32]:
df1

                   A         B         C
2000-01-01  0.394190  0.553871 -0.702523
2000-01-02  0.656177  0.860770 -0.852752
2000-01-03 -1.522828 -1.195615  0.606343
2000-01-04  0.641710 -0.358154 -1.651445
2000-01-05 -0.199631 -0.642619  0.654097
2000-01-06 -0.277858  1.273882 -0.135546

In [33]:
df2 = df1.copy()

In [34]:
df2

                   A         B         C
2000-01-01  0.394190  0.553871 -0.702523
2000-01-02  0.656177  0.860770 -0.852752
2000-01-03 -1.522828 -1.195615  0.606343
2000-01-04  0.641710 -0.358154 -1.651445
2000-01-05 -0.199631 -0.642619  0.654097
2000-01-06 -0.277858  1.273882 -0.135546

In [35]:
dfap = df1.append(df2,ignore_index=True); dfap

           A         B         C
0   0.394190  0.553871 -0.702523
1   0.656177  0.860770 -0.852752
2  -1.522828 -1.195615  0.606343
3   0.641710 -0.358154 -1.651445
4  -0.199631 -0.642619  0.654097
5  -0.277858  1.273882 -0.135546
6   0.394190  0.553871 -0.702523
7   0.656177  0.860770 -0.852752
8  -1.522828 -1.195615  0.606343
9   0.641710 -0.358154 -1.651445
10 -0.199631 -0.642619  0.654097
11 -0.277858  1.273882 -0.135546

In [39]:
 dfe = pd.DataFrame(data={'Area' : ['A'] * 5 + ['C'] * 2,
                        'Bins' : [110] * 2 + [160] * 3 + [40] * 2,
                        'Test_0' : [0, 1, 0, 1, 2, 0, 1],
                        'Data' : np.random.randn(7)});dfe

  Area  Bins      Data  Test_0
0    A   110 -0.412251       0
1    A   110  0.586546       1
2    A   160 -0.201608       0
3    A   160  0.694901       1
4    A   160  0.851832       2
5    C    40  1.966362       0
6    C    40 -0.454327       1

In [41]:
dfe['Test_1'] = dfe['Test_0'] - 1

In [46]:
pd.merge(dfe, dfe, left_on=['Bins', 'Area','Test_0'], right_on=['Bins', 'Area','Test_1'],suffixes=('_L','_R'))

  Area  Bins    Data_L  Test_0_L  Test_1_L    Data_R  Test_0_R  Test_1_R
0    A   110 -0.412251         0        -1  0.586546         1         0
1    A   160 -0.201608         0        -1  0.694901         1         0
2    A   160  0.694901         1         0  0.851832         2         1
3    C    40  1.966362         0        -1 -0.454327         1         0

In [44]:
pd.merge(dfe, dfe, left_on=['Bins','Test_0'], right_on=['Bins','Test_1'],suffixes=('_L','_R'))

,Area_L,Bins,Data_L,Test_0_L,Test_1_L,Area_R,Data_R,Test_0_R,Test_1_R
0,A,110,-0.412251,0,-1,A,0.586546,1,0
1,A,160,-0.201608,0,-1,A,0.694901,1,0
2,A,160,0.694901,1,0,A,0.851832,2,1
3,C,40,1.966362,0,-1,C,-0.454327,1,0

In [47]:
df

   id  key   x   y
0   1    1  33  70
1   2    1  32  71
2   3    2  34  74
3   4    2  35  75

In [49]:
df['id2'] = df['id'] - 1

In [50]:
pd.merge(df, df, left_on=['key','id'], right_on=['key','id2'],suffixes=('_L','_R'))

   id_L  key  x_L  y_L  id2_L  id_R  x_R  y_R  id2_R
0     1    1   33   70      0     2   32   71      1
1     3    2   34   74      2     4   35   75      3